Repository: m1el/cpp-vs-rust
Catalog: po/*.po
Languages: fr_fr

source: BigInt literal contains decimal point
fr_fr: le litéral BigInt contient un séparateur de décimales

source: BigInt literal contains exponent
fr_fr: le litéral BigInt contient un exposant

source: character is not allowed in identifiers
fr_fr: caractère non autorisé dans les identifiants

source: escaped character is not allowed in identifiers
fr_fr: caractère échappé non permis dans les identifiants

source: code point out of range
fr_fr: point de code hors limite

source: code point in Unicode escape sequence must not be greater than U+10FFFF
fr_fr: un point de code dans une séquence d'échappement Unicode ne peut dépasser la valeur U+10FFFF

source: expected hexadecimal digits in Unicode escape sequence
fr_fr: nombres hexadecimaux attendus dans une séquence d'échappement Unicode

source: invalid hex escape sequence: {0}
fr_fr: séquence d'échappement hex invalide: {0}

source: invalid UTF-8 sequence
fr_fr: séquence UTF-8 invalide

source: keywords cannot contain escape sequences
fr_fr: les mots-clés ne peuvent pas contenir de séquence d'échappement

source: legacy octal literal may not be BigInt
fr_fr: un littéral octal classique ne peut pas être de type BigInt

source: legacy octal literals may not contain underscores
fr_fr: un littéral octal classique ne peut pas contenir de tiret de soulignement

source: number literal contains consecutive underscores
fr_fr: le littéral numérique contient plusieurs tirets de soulignement consécutifs

source: number literal contains trailing underscore(s)
fr_fr: le littéral numérique est suivi d'un tiret de soulignement

source: octal literal may not have exponent
fr_fr: un littéral octal ne peut avoir d'exposant

source: octal literal may not have decimal
fr_fr: un littéral octal ne peut avoir de partie décimale

source: RegExp literal flags cannot contain Unicode escapes
fr_fr: un littéral RegExp ne peut contenir des échappements Unicode

source: unclosed block comment
fr_fr: commentaire de bloc non fermé

source: unclosed identifier escape sequence
fr_fr: séquence d'échappement d'identifiant non fermée

source: unclosed regexp literal
fr_fr: littéral regexp non fermé

source: unclosed string literal
fr_fr: littéral string non fermé

source: unclosed template
fr_fr: template non fermé

source: unexpected '@'
fr_fr: '@' inattendu

source: unexpected '\' in identifier
fr_fr: '\' inattendu dans un identifiant

source: unexpected characters in number literal
fr_fr: caractères inattendus dans un littéral numérique

source: unexpected control character
fr_fr: caractère de contrôle inattendu

source: unexpected characters in binary literal
fr_fr: caractères inattendus dans un littéral binaire

source: unexpected characters in octal literal
fr_fr: caractères inattendus dans un littéral octal

source: unexpected characters in hex literal
fr_fr: caractères inattendus dans un littéral hex

source: unopened block comment
fr_fr: commentaire de bloc non ouvert

source: binary number literal has no digits
fr_fr: le littéral numérique binaire n'a pas de chiffres

source: hex number literal has no digits
fr_fr: le littéral numérique hex n'a pas de chiffres

source: octal number literal has no digits
fr_fr: le littéral numérique octal n'a pas de chiffres

source: unexpected '#'
fr_fr: '#' inattendu

source: unicode byte order mark (BOM) cannot appear before #! at beginning of script
fr_fr: un indicateur d'ordre des octets (BOM) ne peut figurer avant #! au début d'un script
